[
    {
        "type": "Same sign",
        "description": "If your partner was born under the same sign as you, the aspect angle tends towards zero. Loving such a person is as natural as loving yourself. You truly have a lot in common, and you can understand each other with half a word; it's remarkably easy for you to be together, and looking at each other 'as in a mirror,' you see reflections of your best and worst qualities. In such a tandem, you can understand what it's like for others to be with you. However, it's important to remember that silence, smoothness, and complete unity hinder the emergence of sparks between you. It eliminates conflicts but may reduce your passion to a sibling-like interaction. Even in the most harmonious union, it's not wise to neglect some autonomy, creating a degree of mutual intrigue – for the sake of romance."
    },
    {
        "type": "Adjacent sign",
        "description": "In this 30-degree aspect, relationships develop akin to neighbors: you've partnered with someone with whom you have little (or nothing) in common, and, to top it off, minimal chances of adapting to individual quirks. Such circumstances are conducive to the emergence of explosive chemistry, fraught with round-the-clock fun and frequent arguments. From this bond, you can gain the ability to accept differences in character/taste, see qualities you lack, venture beyond your comfort zones, and balance in the storm of emotions. Deep down, you understand that the endless quest to understand each other is devilishly difficult, and your couple is not immune to a painful breakup. Nevertheless, you're drawn to each other, and like rebellious teenagers from a Shakespearean play, you follow your feelings, unwilling to acknowledge the fatalism of your connection."
    },
    {
        "type": "One away sign",
        "description": "With someone born under a sign that is 60 degrees apart from yours on the zodiacal circle, you feel calm and comfortable. This union is defined by the compatibility of elements – for example, your partner's sign may be of a watery nature while yours is earthy, and both of you possess feminine qualities in astrology. Generally, individuals in many aspects of love have similar views on daily life, politics, family, and other values. In such relationships, you can be who you are, accepting each other with all strengths and weaknesses, having the ability to speak, listen, and be heard. However, there's a nuance: this connection is based on friendship, from which romantic attachment develops, which is great for lifelong relationships but challenging to maintain mutual attraction."
    },
    {
        "type": "Two away sign",
        "description": "A 90-degree aspect between two signs signifies a relationship in which effort is required – both in terms of the relationship and personal growth. Sometimes, the Universe presents karmic relationships at this angle, the meaning of which is to learn something, correct a past mistake, or overcome painful childhood traumas. Don't expect to relax – such a match will keep you constantly stimulated, teaching you mutual respect and compromise. You can remain true to your own principles and stubbornness, but if you manage to master delicate cooperation, you will establish an inexhaustible energy resource – for both of you."
    },
    {
        "type": "Three away sign",
        "description": "I won't deny it – a romance between individuals of the same elements promises genuine harmony. Entering into a relationship with someone from the same trine, you get an ideal partner. With them, you can be maximally natural, relax, and not pretend about anything, openly and directly expressing your thoughts and feelings. Astrologers give the same advice to 'elemental' lovers as they do to couples in a conjunction aspect: don't completely blur the boundaries, merging with each other in all aspects of existence. Take care to preserve individual space – it will benefit mutual attraction."
    },
    {
        "type": "Four away sign",
        "description": "An aspect defined by a cosmic angle of 150 degrees predicts a complex but captivating combination – true roller coasters in relationships. If you're lucky, you'll feel like you've met a kindred spirit, but if not, you'll find yourself in bed with an enemy. In most cases, both feelings will be available from time to time, and it's up to you how long you'll last on this ride. At first glance, you and your partner have nothing in common. 'How do these two get along?' others wonder. However, from a cosmic perspective, such a union is not without meaning: perhaps the connection is given to you to expand your understanding of your own attractiveness or to learn care and support. If you can adapt to each other's differences, you can create an unbreakable team."
    },
    {
        "type": "Five away sign",
        "description": "The aspect of opposition means that your partner was born under a sign opposite yours on the zodiacal circle. The surprise is that despite the name of the aspect, such a connection provides plenty of opportunities for self-development. Moreover, in an oppositional tandem, you may encounter a soulmate, your true other half, with whom you are karmically connected on a spiritual level. The zodiacal opposition triggers internal resources previously unknown to you. You will learn to regulate the extremes of your nature, such as selflessness or selfishness, independence or codependency, and gradually adapting to partnership, you will discern new, inspiring perspectives. In a union with the opposite sign, you will gain the ability to see the bigger picture of life and your destiny, without being distracted by minor details."
    }
]
